{
  "meta": {
    "source": "AXIS Riders FB Group - Surge search",
    "extracted_at": "2026-02-11",
    "total_entries": 18
  },
  "feedback": [
    {
      "foils_mentioned": [
        "Surge 320"
      ],
      "rider_weight": "85kg",
      "rider_weight_lbs": 187,
      "use_cases": [
        "sup",
        "prone",
        "wing",
        "downwind"
      ],
      "excerpt": "‘Bonjour je fais 65ka jsut en préne la SF 960 a BA0Et est op pette pour mon niveau (pas vous conseilez quelle tale de surge pour garder la méme portance ? Merck 'avance tt holo do 85kg I sur in prone the $F 960 the 840st ston small formy level not tsted the \\What size surge do you recommend to keep the same wear? Thank youin advance!"
    },
    {
      "foils_mentioned": [
        "Surge 830"
      ],
      "rider_weight": null,
      "rider_weight_lbs": null,
      "use_cases": [
        "sup",
        "wing",
        "downwind"
      ],
      "excerpt": "be Like Q comment D send ust hae my fst crack nthe waves onthe 830 surge wth ultashor fuse and 300 sur skinny! Found 1 tal shim tebe super balanced and was blown away wth my turns and confidence on {he ist takeoff, prety rare to fin that feeing in a matter of seconds on fll without"
    },
    {
      "foils_mentioned": [
        "Surge 1010",
        "Surge 830"
      ],
      "rider_weight": null,
      "rider_weight_lbs": null,
      "use_cases": [
        "sup",
        "wing",
        "prone",
        "pump"
      ],
      "excerpt": "Love those spots everyone can just get along. sharing waves with the local lngboarders ani surge 1010 working wonders on shot interval windswel coming into bay D tke Q comment F send Love those spots everyone can just get along. sharing waves wit the local ongboarders"
    },
    {
      "foils_mentioned": [
        "Surge 890"
      ],
      "rider_weight": "70kg",
      "rider_weight_lbs": 154,
      "use_cases": [
        "prone",
        "parawing",
        "downwind",
        "pump",
        "wing"
      ],
      "excerpt": "OW tie Ross, kit Erdely and 53 others 13 comment Realy loving the new surge 890. ‘Seems todo al, Wing, one, owning ownusinding Axis Surge 890%)"
    },
    {
      "foils_mentioned": [
        "Surge 780",
        "Surge 950",
        "Surge 830"
      ],
      "rider_weight": "75kg",
      "rider_weight_lbs": 165,
      "use_cases": [
        "prone",
        "sup",
        "parawing",
        "downwind",
        "pump",
        "wing"
      ],
      "excerpt": "LUtvashert fuse BUT 1 have an Ultrashort sdvance +60 on oder .8m 75 kg, Any comments Fealyaporeceteg, thanks of tke Q comment D send ‘Surge 780, the surest fol iret is an amazing ol @ or"
    },
    {
      "foils_mentioned": [
        "Surge 1080",
        "Surge 950",
        "Surge 890",
        "Surge 1010",
        "Surge 830"
      ],
      "rider_weight": "78kg",
      "rider_weight_lbs": 172,
      "use_cases": [
        "wing",
        "sup",
        "pump"
      ],
      "excerpt": "{© Dans Dinsmore, Nathan Coffman ‘The Surge Kick on the surge 890 the itis very quck and abrupt, not ike the slew transition cof my spits or v2 999. fit ean do the bucking bronce (nose rearing up). Is anyone else having this problem? 'm an older fi iver, 5'5* super trench, a5 litres, ultrashort fuse"
    },
    {
      "foils_mentioned": [
        "Surge 950"
      ],
      "rider_weight": null,
      "rider_weight_lbs": null,
      "use_cases": [
        "prone",
        "wing",
        "downwind"
      ],
      "excerpt": "fb lke Q comment 7 send | putthe new Ais SURGE 960 tothe tet today to see hw fast you can really go ona surty ownind run, and it absolutely blew my mind Yesterday I a run at 2 minutes 6 seconds forthe lomete, max speed around 36 kmh. That"
    },
    {
      "foils_mentioned": [
        "Surge 890",
        "Surge 950"
      ],
      "rider_weight": null,
      "rider_weight_lbs": null,
      "use_cases": [
        "wing",
        "prone",
        "pump"
      ],
      "excerpt": "Like Q comment D send How goed is the 1010 surge for winging in waves? Was gonna go 050 but also wanna start parauing. (maybe FD to}}& thought 1010 would make easier. go the epty 1030900, art \"Nonstop fling thanks to ove. The aus surge 950 and 1010 ate so goood with 4 Loving"
    },
    {
      "foils_mentioned": [
        "Surge 890",
        "Surge 950"
      ],
      "rider_weight": null,
      "rider_weight_lbs": null,
      "use_cases": [
        "prone"
      ],
      "excerpt": "db Like Q comment FD sona \"Nonstop fling thanks to foerive. The axis surge 950 and 1010 are so gocod with fd Loving fw end for early got up on fo. Popping up Tater than | do on small spies and smal: {OO ars Dinsmore, Mike oss nd 34 others ‘Beommens"
    },
    {
      "foils_mentioned": [
        "Surge 1010",
        "Surge 950",
        "Surge 830"
      ],
      "rider_weight": null,
      "rider_weight_lbs": null,
      "use_cases": [
        "sup",
        "wing",
        "prone"
      ],
      "excerpt": "{© Tim Roeder, Erlend Madsen and 2% others Like Q comment @ send Last Saturday while on Kauai ida dame meet up with the surge 950 (stv) and 1010 (re ia} witha loal prone fll. Small worl. Found out sent his brother 3 repacement part 2"
    },
    {
      "foils_mentioned": [
        "Tempo 1020"
      ],
      "rider_weight": "95kg",
      "rider_weight_lbs": 209,
      "use_cases": [
        "prone",
        "sup",
        "downwind",
        "pump",
        "wing"
      ],
      "excerpt": "(© Mike Ross, Peter Latalle and 62 others 22 comments Like Q comment 7 send ust ie a tempo 1020 and they are ely awesome fl! There's a crezy forward push that just keeps I going fast Realy amazing for dourwinding"
    },
    {
      "foils_mentioned": [
        "Art 999",
        "Surge 950"
      ],
      "rider_weight": null,
      "rider_weight_lbs": null,
      "use_cases": [],
      "excerpt": "For those that are able, with specific reference to Bottomiend, What would the surge to art v2 comparison Appreciate they might over lap or be ordered between sizes too. Help a brother out."
    },
    {
      "foils_mentioned": [
        "Surge 830"
      ],
      "rider_weight": null,
      "rider_weight_lbs": null,
      "use_cases": [
        "sup",
        "parawing",
        "downwind",
        "pump",
        "wing"
      ],
      "excerpt": "veal stoked wth the wing, should serve me perfectly fr parawing and sup sur. fam thinking 2.950 +1080 surge would cover mo for everythin | want oo sup sur, parawing and wing in anything from smal bumps up to proper bia swells. When can get the 1080? & [Adrian Roper spewing | missed your talk tthe Fol Shop t would have been great te come and"
    },
    {
      "foils_mentioned": [
        "Surge 1010",
        "Fireball 1070"
      ],
      "rider_weight": "90kg",
      "rider_weight_lbs": 198,
      "use_cases": [
        "wing",
        "downwind"
      ],
      "excerpt": "It because there was too much bloody seaveed so swapped out forthe old wusty seaweed | 2m 210 bs (5g) and | ached Evan from AXIS which Surge would be bes forme for \\infoiina in Waves/Bumpe/Swel and beginning todo Parauing Downwindes. | sid can only Aatford ane fol so the Suge sie | pick as to perform inthe widest range of eoniton for me."
    },
    {
      "foils_mentioned": [
        "Art 9302"
      ],
      "rider_weight": "86kg",
      "rider_weight_lbs": 190,
      "use_cases": [
        "wing",
        "sup",
        "pump"
      ],
      "excerpt": "D tike Q comment T send Samm '55 to 2:30 min per km speed range and 890 2:50 to 210 min per km The 18908 8 gem downing, especially in big and wld acean conditions. ‘These ride biog than you tink, 890s closer to art 9302 bu wth more range and tums way"
    },
    {
      "foils_mentioned": [
        "Surge 1010",
        "Fireball 1070",
        "Surge 950"
      ],
      "rider_weight": "90kg",
      "rider_weight_lbs": 198,
      "use_cases": [
        "wing",
        "downwind",
        "parawing"
      ],
      "excerpt": "‘Surge 1010 for Bay Style Dowrwinder. Just had my second downwinder on the 1010 and have te say t's the most fun ve nad downwinng! t's eting me make the tums avays wanted to but couldn't ands letting me away with stuf that would normally take me down. Bumps today started waist high but went head high from the hala point | could've easiy dropped a c"
    },
    {
      "foils_mentioned": [
        "Art 9392",
        "Surge 890"
      ],
      "rider_weight": "86kg",
      "rider_weight_lbs": 190,
      "use_cases": [
        "sup",
        "prone",
        "downwind",
        "pump"
      ],
      "excerpt": "feet ike a mach beter oe nan sctualy am. lean ink woves reasonable comfortably which ve never been able todo. (have the craze onthe control set at 63% wich Loni use when mang my 1099 V2, normaly its closer to 70% onthe 999V2. | watched an interview vith ‘Sven Mayor from WA and he was asked what fist replaces and he laughed and sad all of"
    },
    {
      "foils_mentioned": [
        "Surge 890"
      ],
      "rider_weight": "100kg",
      "rider_weight_lbs": 220,
      "use_cases": [
        "sup",
        "wing",
        "prone",
        "parawing"
      ],
      "excerpt": "(© dAnciew Cask, Rush Mark Rush and 290 13 comment | want Surge. lam upgrading from 930v? (or prone in waves wit FllDsve). Would it be the db Like Q comment F send Fest prone session onthe new Surge and ert skinny Really imorested this setup has amazing"
    }
  ]
}